app/views/notes/_form.html.erb

SELECT "notes".* FROM "notes"
---
    <%= f.label :Categorie %><br />
    <%= collection_select(:note, :category_id, Note.all, :id, :name)