app/views/notes/_form.html.erb

    <%= f.label :Categorie %><br />
    <%= f.collection_select :Categorie, current_user.categories.all, :id, :nom, prompt: true %>
---
SELECT "categories".* FROM "categories"