app/views/notes/index.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 3
---

<% current_user.notes.each do |note| %>