app/views/shared/_user_info.html.erb

    <span class="micropost">
      <%= pluralize(current_user.microposts.count, "micropost") %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1