app/controllers/categories_controller.rb

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @category = current_user.categories.build(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "nom", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 08 Feb 2014 15:34:47 UTC +00:00], ["nom", nil], ["updated_at", Sat, 08 Feb 2014 15:34:47 UTC +00:00]]

  def update
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]