app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Je viens de finir mon premier petit message\r\n"], ["created_at", Mon, 29 Oct 2012 19:19:45 UTC +00:00], ["updated_at", Mon, 29 Oct 2012 19:19:45 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "3"]]
---
    def show
    @note = Micropost.find(params[:id])