app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT "notes".* FROM "notes"

  def show
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @note = current_user.notes.build(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("Categorie", "Commentaire", "Date", "Difficulte", "Duree", "Texte", "Titre", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "notes" SET "Categorie" = 0, "Duree" = 0, "Difficulte" = 0, "Titre" = 'Test', "Texte" = 'Test', "Commentaire" = 'Test', "updated_at" = '2014-01-21 12:28:28.410774' WHERE "notes"."id" = 1

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]