app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @micropost = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "nom", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def index
    @title = "Tous les utilisateurs"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

   def following
    @titre = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def followers
    @titre = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1