app/views/categories/index.html.erb

SELECT "categories".* FROM "categories"
---

<% current_user.categories.each do |category| %>